#include <stdio.h>

// space_bar: 32
// up:		224, 72
// down:	224, 80
// left:	224, 75
// right:	224, 77

void stage1()
{
	char map1[30][150] = 
	{   {"¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á															¡á\n"}, 
		{"¡á															¡á\n"}, 
		{"¡á															¡á\n"}, 
		{"¡á															¡á\n"},
		{"¡á															¡á\n"},
		{"¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á\n"}, };


	for (int i = 0; i <30 ; i++)
	{
		printf("%s", map1[i]);
	}


	return;
}

//int plus(int a, int b)
//{
//	return a + b;
//}